Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchForCeiling Property
 Ceiling sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchForCeiling { get; }
Public Shared ReadOnly Property InvalidSketchForCeiling As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchForCeiling {
	FailureDefinitionId^ get ();
}
static member InvalidSketchForCeiling : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace